TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/hw_unicommspi.h
/** @addtogroup UNICOMMSPI
  @{
*/

typedef struct {
       uint32_t RESERVED0[1024];
  __IO uint32_t CLKDIV;                            /* !< (@ 0x00001000) Clock Divider */
       uint32_t RESERVED1;
  __IO uint32_t CLKSEL;                            /* !< (@ 0x00001008) Clock Select for Ultra Low Power peripherals */
       uint32_t RESERVED2[3];
  __IO uint32_t PDBGCTL;                           /* !< (@ 0x00001018) Peripheral Debug Control */
       uint32_t RESERVED3;
  UNICOMMSPI_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00001020) */
       uint32_t RESERVED4;
  UNICOMMSPI_DMA_TRIG_RX_Regs  DMA_TRIG_RX;                       /* !< (@ 0x00001050) */
       uint32_t RESERVED5[3];
  UNICOMMSPI_DMA_TRIG_TX_Regs  DMA_TRIG_TX;                       /* !< (@ 0x00001080) */
       uint32_t RESERVED6[3];
  UNICOMMSPI_SPGDMA_Regs  SPGDMA;                            /* !< (@ 0x000010B0) */
       uint32_t RESERVED7[5];
  __O  uint32_t INTCTL;                            /* !< (@ 0x000010E4) Interrupt control register */
       uint32_t RESERVED8[6];
  __IO uint32_t CTL0;                              /* !< (@ 0x00001100) SPI control register 0 */
       uint32_t RESERVED9;
  __I  uint32_t STAT;                              /* !< (@ 0x00001108) Status Register */
  __IO uint32_t IFLS;                              /* !< (@ 0x0000110C) Interrupt FIFO Level Select Register */
  __IO uint32_t CLKCTL;                            /* !< (@ 0x00001110) Clock prescaler and divider register. */
       uint32_t RESERVED10[3];
  __O  uint32_t TXDATA;                            /* !< (@ 0x00001120) TXDATA Register */
  __I  uint32_t RXDATA;                            /* !< (@ 0x00001124) RXDATA Register */
       uint32_t RESERVED11[9];
  __IO uint32_t CTL1;                              /* !< (@ 0x0000114C) SPI control register 1 */
} UNICOMMSPI_Regs;

/*@}*/ /* end of group UNICOMMSPI */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* UNICOMMSPI Register Control Bits
******************************************************************************/

/* UNICOMMSPI_SPGDMARXCTL Bits */
/* UNICOMMSPI_SPGDMARXCTL[DMAEN] Bits */
#define UNICOMMSPI_SPGDMARXCTL_DMAEN_OFS         (1)                             /* !< DMAEN Offset */
#define UNICOMMSPI_SPGDMARXCTL_DMAEN_MASK        ((uint32_t)0x00000002U)         /* !< DMA enable */
#define UNICOMMSPI_SPGDMARXCTL_DMAEN_DISABLE     ((uint32_t)0x00000000U)         /* !< DMA channel disabled */
#define UNICOMMSPI_SPGDMARXCTL_DMAEN_ENABLE      ((uint32_t)0x00000002U)         /* !< DMA channel enabled */
/* UNICOMMSPI_SPGDMARXCTL[DMAMEMINCR] Bits */
#define UNICOMMSPI_SPGDMARXCTL_DMAMEMINCR_OFS    (20)                            /* !< DMAMEMINCR Offset */
#define UNICOMMSPI_SPGDMARXCTL_DMAMEMINCR_MASK   ((uint32_t)0x00100000U)         /* !< DMA destination increment. This bit
                                                                                    selects automatic incrementing or
                                                                                    decrementing of the destination
                                                                                    address DMADA for each transfer. The
                                                                                    amount of change to the DMADA is
                                                                                    based on the definition in the
                                                                                    DMADSTWDTH. For example, an increment
                                                                                    of 1 (+1) on a WORD transfer will
                                                                                    increment the DMADA by 4. */
#define UNICOMMSPI_SPGDMARXCTL_DMAMEMINCR_INCREMENT ((uint32_t)0x00000000U)         /* !< Incremented by 1 (+1 * DMADSTWDTH) */
#define UNICOMMSPI_SPGDMARXCTL_DMAMEMINCR_DECREMENT ((uint32_t)0x00100000U)         /* !< Decremented by 1 (-1 * DMADSTWDTH) */
/* UNICOMMSPI_SPGDMARXCTL[DMAPREIRQ] Bits */
#define UNICOMMSPI_SPGDMARXCTL_DMAPREIRQ_OFS     (24)                            /* !< DMAPREIRQ Offset */
#define UNICOMMSPI_SPGDMARXCTL_DMAPREIRQ_MASK    ((uint32_t)0x01000000U)         /* !< Enable an early IRQ event. This can
                                                                                    help software to react quicker to and
                                                                                    DMA done event or allows some
                                                                                    additional configuration before the
                                                                                    channel is complete.   Note: This
                                                                                    register is only available in a
                                                                                    FULL-channel configuration. Please
                                                                                    consult the datasheet of the specific
                                                                                    device to map which channel number
                                                                                    has FULL or BASIC capability. In a
                                                                                    BASIC configuration this register is
                                                                                    a read only value and always reads as
                                                                                    0x0. */
#define UNICOMMSPI_SPGDMARXCTL_DMAPREIRQ_PREIRQ_DISABLE ((uint32_t)0x00000000U)         /* !< Pre-IRQ event disabled. */
#define UNICOMMSPI_SPGDMARXCTL_DMAPREIRQ_PREIRQ_HALF ((uint32_t)0x01000000U)         /* !< Issue Pre-IRQ event when DMASZ
                                                                                    reached the half size point of the
                                                                                    original transfer size */
/* UNICOMMSPI_SPGDMARXCTL[DMATM] Bits */
#define UNICOMMSPI_SPGDMARXCTL_DMATM_OFS         (27)                            /* !< DMATM Offset */
#define UNICOMMSPI_SPGDMARXCTL_DMATM_MASK        ((uint32_t)0x08000000U)         /* !< DMA transfer mode register */
#define UNICOMMSPI_SPGDMARXCTL_DMATM_SINGLE      ((uint32_t)0x00000000U)         /* !< Single transfer. Each transfer
                                                                                    requires a new trigger. When the
                                                                                    DMASZ counts down to zero an event
                                                                                    can be generated and the DMAEN is
                                                                                    cleared. */
#define UNICOMMSPI_SPGDMARXCTL_DMATM_RPTSNGL     ((uint32_t)0x08000000U)         /* !< Repeated single transfer. Each
                                                                                    transfer requires a new trigger. When
                                                                                    the DMASZ counts down to zero an
                                                                                    event can be generated. After the
                                                                                    last transfer the DMASA, DMADA, DAMSZ
                                                                                    registers are restored to its initial
                                                                                    value and the DMAEN stays enabled. */
/* UNICOMMSPI_SPGDMARXCTL[DMADSTWDTH] Bits */
#define UNICOMMSPI_SPGDMARXCTL_DMADSTWDTH_OFS    (28)                            /* !< DMADSTWDTH Offset */
#define UNICOMMSPI_SPGDMARXCTL_DMADSTWDTH_MASK   ((uint32_t)0x30000000U)         /* !< DMA destination width. This bit
                                                                                    selects the destination as a byte,
                                                                                    half word, word or long word. */
#define UNICOMMSPI_SPGDMARXCTL_DMADSTWDTH_BYTE   ((uint32_t)0x00000000U)         /* !< Destination data width is BYTE
                                                                                    (8-bit) */
#define UNICOMMSPI_SPGDMARXCTL_DMADSTWDTH_HALF   ((uint32_t)0x10000000U)         /* !< Destination data width is HALF-WORD
                                                                                    (16-bit) */
#define UNICOMMSPI_SPGDMARXCTL_DMADSTWDTH_WORD   ((uint32_t)0x20000000U)         /* !< Destination data width is WORD
                                                                                    (32-bit) */

/* UNICOMMSPI_SPGDMARXDA Bits */
/* UNICOMMSPI_SPGDMARXDA[ADDR] Bits */
#define UNICOMMSPI_SPGDMARXDA_ADDR_OFS           (0)                             /* !< ADDR Offset */
#define UNICOMMSPI_SPGDMARXDA_ADDR_MASK          ((uint32_t)0xFFFFFFFFU)         /* !< DMA Channel Destination Address */
#define UNICOMMSPI_SPGDMARXDA_ADDR_MINIMUM       ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMSPI_SPGDMARXDA_ADDR_MAXIMUM       ((uint32_t)0xFFFFFFFFU)         /* !< Highest possible value */

/* UNICOMMSPI_SPGDMARXSZ Bits */
/* UNICOMMSPI_SPGDMARXSZ[SIZE] Bits */
#define UNICOMMSPI_SPGDMARXSZ_SIZE_OFS           (0)                             /* !< SIZE Offset */
#define UNICOMMSPI_SPGDMARXSZ_SIZE_MASK          ((uint32_t)0x0000FFFFU)         /* !< DMA Channel Size in number of
                                                                                    transfers */
#define UNICOMMSPI_SPGDMARXSZ_SIZE_MINIMUM       ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMSPI_SPGDMARXSZ_SIZE_MAXIMUM       ((uint32_t)0x0000FFFFU)         /* !< Highest possible value */

/* UNICOMMSPI_SPGDMATXCTL Bits */
/* UNICOMMSPI_SPGDMATXCTL[DMAEN] Bits */
#define UNICOMMSPI_SPGDMATXCTL_DMAEN_OFS         (1)                             /* !< DMAEN Offset */
#define UNICOMMSPI_SPGDMATXCTL_DMAEN_MASK        ((uint32_t)0x00000002U)         /* !< DMA enable */
#define UNICOMMSPI_SPGDMATXCTL_DMAEN_DISABLE     ((uint32_t)0x00000000U)         /* !< DMA channel disabled */
#define UNICOMMSPI_SPGDMATXCTL_DMAEN_ENABLE      ((uint32_t)0x00000002U)         /* !< DMA channel enabled */
/* UNICOMMSPI_SPGDMATXCTL[DMAMEMINCR] Bits */
#define UNICOMMSPI_SPGDMATXCTL_DMAMEMINCR_OFS    (20)                            /* !< DMAMEMINCR Offset */
#define UNICOMMSPI_SPGDMATXCTL_DMAMEMINCR_MASK   ((uint32_t)0x00100000U)         /* !< DMA destination increment. This bit
                                                                                    selects automatic incrementing or
                                                                                    decrementing of the destination
                                                                                    address DMADA for each transfer. The
                                                                                    amount of change to the DMADA is
                                                                                    based on the definition in the
                                                                                    DMADSTWDTH. For example, an increment
                                                                                    of 1 (+1) on a WORD transfer will
                                                                                    increment the DMADA by 4. */
#define UNICOMMSPI_SPGDMATXCTL_DMAMEMINCR_INCREMENT ((uint32_t)0x00000000U)         /* !< Incremented by 1 (+1 * DMASRCWDTH) */
#define UNICOMMSPI_SPGDMATXCTL_DMAMEMINCR_DECREMENT ((uint32_t)0x00100000U)         /* !< Decremented by 1 (-1 * DMASRCWDTH) */
/* UNICOMMSPI_SPGDMATXCTL[DMAPREIRQ] Bits */
#define UNICOMMSPI_SPGDMATXCTL_DMAPREIRQ_OFS     (24)                            /* !< DMAPREIRQ Offset */
#define UNICOMMSPI_SPGDMATXCTL_DMAPREIRQ_MASK    ((uint32_t)0x01000000U)         /* !< Enable an early IRQ event. This can
                                                                                    help software to react quicker to and
                                                                                    DMA done event or allows some
                                                                                    additional configuration before the
                                                                                    channel is complete.   Note: This
                                                                                    register is only available in a
                                                                                    FULL-channel configuration. Please
                                                                                    consult the datasheet of the specific
                                                                                    device to map which channel number
                                                                                    has FULL or BASIC capability. In a
                                                                                    BASIC configuration this register is
                                                                                    a read only value and always reads as
                                                                                    0x0. */
#define UNICOMMSPI_SPGDMATXCTL_DMAPREIRQ_PREIRQ_DISABLE ((uint32_t)0x00000000U)         /* !< Pre-IRQ event disabled. */
#define UNICOMMSPI_SPGDMATXCTL_DMAPREIRQ_PREIRQ_HALF ((uint32_t)0x01000000U)         /* !< Issue Pre-IRQ event when DMASZ
                                                                                    reached the half size point of the
                                                                                    original transfer size */
/* UNICOMMSPI_SPGDMATXCTL[DMATM] Bits */
#define UNICOMMSPI_SPGDMATXCTL_DMATM_OFS         (27)                            /* !< DMATM Offset */
#define UNICOMMSPI_SPGDMATXCTL_DMATM_MASK        ((uint32_t)0x08000000U)         /* !< DMA transfer mode register  Note:
                                                                                    The repeat-single (2h) and
                                                                                    repeat-block (3h) transfer are only
                                                                                    available in a FULL-channel
                                                                                    configuration. Please consult the
                                                                                    datasheet of the specific device to
                                                                                    map which channel number has FULL or
                                                                                    BASIC capability. In a BASIC channel
                                                                                    configuration only the values for
                                                                                    single (0h) and block (1h) transfer
                                                                                    can be set. */
#define UNICOMMSPI_SPGDMATXCTL_DMATM_SINGLE      ((uint32_t)0x00000000U)         /* !< Single transfer. Each transfer
                                                                                    requires a new trigger. When the
                                                                                    DMASZ counts down to zero an event
                                                                                    can be generated and the DMAEN is
                                                                                    cleared. */
#define UNICOMMSPI_SPGDMATXCTL_DMATM_RPTSNGL     ((uint32_t)0x08000000U)         /* !< Repeated single transfer. Each
                                                                                    transfer requires a new trigger. When
                                                                                    the DMASZ counts down to zero an
                                                                                    event can be generated. After the
                                                                                    last transfer the DMASA, DMADA, DAMSZ
                                                                                    registers are restored to its initial
                                                                                    value and the DMAEN stays enabled. */
/* UNICOMMSPI_SPGDMATXCTL[DMASRCWDTH] Bits */
#define UNICOMMSPI_SPGDMATXCTL_DMASRCWDTH_OFS    (28)                            /* !< DMASRCWDTH Offset */
#define UNICOMMSPI_SPGDMATXCTL_DMASRCWDTH_MASK   ((uint32_t)0x30000000U)         /* !< DMA source width. This bit selects
                                                                                    the source data width as a byte, half
                                                                                    word, word or long word. */
#define UNICOMMSPI_SPGDMATXCTL_DMASRCWDTH_BYTE   ((uint32_t)0x00000000U)         /* !< Source data width is BYTE (8-bit) */
#define UNICOMMSPI_SPGDMATXCTL_DMASRCWDTH_HALF   ((uint32_t)0x10000000U)         /* !< Source data width is HALF-WORD
                                                                                    (16-bit) */
#define UNICOMMSPI_SPGDMATXCTL_DMASRCWDTH_WORD   ((uint32_t)0x20000000U)         /* !< Source data width is WORD (32-bit) */

/* UNICOMMSPI_SPGDMATXSA Bits */
/* UNICOMMSPI_SPGDMATXSA[ADDR] Bits */
#define UNICOMMSPI_SPGDMATXSA_ADDR_OFS           (0)                             /* !< ADDR Offset */
#define UNICOMMSPI_SPGDMATXSA_ADDR_MASK          ((uint32_t)0xFFFFFFFFU)         /* !< DMA Channel Destination Address */
#define UNICOMMSPI_SPGDMATXSA_ADDR_MINIMUM       ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMSPI_SPGDMATXSA_ADDR_MAXIMUM       ((uint32_t)0xFFFFFFFFU)         /* !< Highest possible value */

/* UNICOMMSPI_SPGDMATXSZ Bits */
/* UNICOMMSPI_SPGDMATXSZ[SIZE] Bits */
#define UNICOMMSPI_SPGDMATXSZ_SIZE_OFS           (0)                             /* !< SIZE Offset */
#define UNICOMMSPI_SPGDMATXSZ_SIZE_MASK          ((uint32_t)0x0000FFFFU)         /* !< DMA Channel Size in number of
                                                                                    transfers */
#define UNICOMMSPI_SPGDMATXSZ_SIZE_MINIMUM       ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMSPI_SPGDMATXSZ_SIZE_MAXIMUM       ((uint32_t)0x0000FFFFU)         /* !< Highest possible value */

/* UNICOMMSPI_DMA_TRIG_TX_IMASK Bits */
/* UNICOMMSPI_DMA_TRIG_TX_IMASK[TX] Bits */
#define UNICOMMSPI_DMA_TRIG_TX_IMASK_TX_OFS      (5)                             /* !< TX Offset */
#define UNICOMMSPI_DMA_TRIG_TX_IMASK_TX_MASK     ((uint32_t)0x00000020U)         /* !< Transmit FIFO event mask. */
#define UNICOMMSPI_DMA_TRIG_TX_IMASK_TX_CLR      ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMSPI_DMA_TRIG_TX_IMASK_TX_SET      ((uint32_t)0x00000020U)         /* !< Set Interrupt Mask */

/* UNICOMMSPI_DMA_TRIG_TX_RIS Bits */
/* UNICOMMSPI_DMA_TRIG_TX_RIS[TX] Bits */
#define UNICOMMSPI_DMA_TRIG_TX_RIS_TX_OFS        (5)                             /* !< TX Offset */
#define UNICOMMSPI_DMA_TRIG_TX_RIS_TX_MASK       ((uint32_t)0x00000020U)         /* !< Transmit FIFO event: A read returns
                                                                                    the current mask for transmit FIFO
                                                                                    interrupt. On a write of 1, the mask
                                                                                    for transmit FIFO interrupt is set
                                                                                    which means the interrupt state will
                                                                                    be reflected in MIS.TXMIS. A write of
                                                                                    0 clears the mask which means
                                                                                    MIS.TXMIS will not reflect the
                                                                                    interrupt. */
#define UNICOMMSPI_DMA_TRIG_TX_RIS_TX_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMSPI_DMA_TRIG_TX_RIS_TX_SET        ((uint32_t)0x00000020U)         /* !< Interrupt occurred */

/* UNICOMMSPI_DMA_TRIG_TX_MIS Bits */
/* UNICOMMSPI_DMA_TRIG_TX_MIS[TX] Bits */
#define UNICOMMSPI_DMA_TRIG_TX_MIS_TX_OFS        (5)                             /* !< TX Offset */
#define UNICOMMSPI_DMA_TRIG_TX_MIS_TX_MASK       ((uint32_t)0x00000020U)         /* !< Masked Transmit FIFO event */
#define UNICOMMSPI_DMA_TRIG_TX_MIS_TX_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMSPI_DMA_TRIG_TX_MIS_TX_SET        ((uint32_t)0x00000020U)         /* !< Interrupt occurred */

/* UNICOMMSPI_DMA_TRIG_TX_ISET Bits */
/* UNICOMMSPI_DMA_TRIG_TX_ISET[TX] Bits */
#define UNICOMMSPI_DMA_TRIG_TX_ISET_TX_OFS       (5)                             /* !< TX Offset */
#define UNICOMMSPI_DMA_TRIG_TX_ISET_TX_MASK      ((uint32_t)0x00000020U)         /* !< Set Transmit FIFO event. */
#define UNICOMMSPI_DMA_TRIG_TX_ISET_TX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMSPI_DMA_TRIG_TX_ISET_TX_SET       ((uint32_t)0x00000020U)         /* !< Set Interrupt */

/* UNICOMMSPI_DMA_TRIG_RX_IMASK Bits */
/* UNICOMMSPI_DMA_TRIG_RX_IMASK[RX] Bits */
#define UNICOMMSPI_DMA_TRIG_RX_IMASK_RX_OFS      (2)                             /* !< RX Offset */
#define UNICOMMSPI_DMA_TRIG_RX_IMASK_RX_MASK     ((uint32_t)0x00000004U)         /* !< Receive FIFO event mask. */
#define UNICOMMSPI_DMA_TRIG_RX_IMASK_RX_CLR      ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMSPI_DMA_TRIG_RX_IMASK_RX_SET      ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* UNICOMMSPI_DMA_TRIG_RX_IMASK[RTOUT] Bits */
#define UNICOMMSPI_DMA_TRIG_RX_IMASK_RTOUT_OFS   (9)                             /* !< RTOUT Offset */
#define UNICOMMSPI_DMA_TRIG_RX_IMASK_RTOUT_MASK  ((uint32_t)0x00000200U)         /* !< SPI Receive Time-Out event mask. */
#define UNICOMMSPI_DMA_TRIG_RX_IMASK_RTOUT_CLR   ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMSPI_DMA_TRIG_RX_IMASK_RTOUT_SET   ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */

