TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/hw_unicommspi.h
/* UNICOMMSPI_DMA_TRIG_RX_RIS Bits */
/* UNICOMMSPI_DMA_TRIG_RX_RIS[RX] Bits */
#define UNICOMMSPI_DMA_TRIG_RX_RIS_RX_OFS        (2)                             /* !< RX Offset */
#define UNICOMMSPI_DMA_TRIG_RX_RIS_RX_MASK       ((uint32_t)0x00000004U)         /* !< Receive FIFO event.This interrupt
                                                                                    is set if the selected Receive FIFO
                                                                                    level has been reached */
#define UNICOMMSPI_DMA_TRIG_RX_RIS_RX_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMSPI_DMA_TRIG_RX_RIS_RX_SET        ((uint32_t)0x00000004U)         /* !< Interrupt occurred */
/* UNICOMMSPI_DMA_TRIG_RX_RIS[RTOUT] Bits */
#define UNICOMMSPI_DMA_TRIG_RX_RIS_RTOUT_OFS     (9)                             /* !< RTOUT Offset */
#define UNICOMMSPI_DMA_TRIG_RX_RIS_RTOUT_MASK    ((uint32_t)0x00000200U)         /* !< SPI Receive Time-Out Event.  This
                                                                                    bit is set when there is still
                                                                                    contents in the FIFO after the
                                                                                    timeout period */
#define UNICOMMSPI_DMA_TRIG_RX_RIS_RTOUT_CLR     ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMSPI_DMA_TRIG_RX_RIS_RTOUT_SET     ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */

/* UNICOMMSPI_DMA_TRIG_RX_MIS Bits */
/* UNICOMMSPI_DMA_TRIG_RX_MIS[RX] Bits */
#define UNICOMMSPI_DMA_TRIG_RX_MIS_RX_OFS        (2)                             /* !< RX Offset */
#define UNICOMMSPI_DMA_TRIG_RX_MIS_RX_MASK       ((uint32_t)0x00000004U)         /* !< Receive FIFO event mask. */
#define UNICOMMSPI_DMA_TRIG_RX_MIS_RX_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMSPI_DMA_TRIG_RX_MIS_RX_SET        ((uint32_t)0x00000004U)         /* !< Interrupt occurred */
/* UNICOMMSPI_DMA_TRIG_RX_MIS[RTOUT] Bits */
#define UNICOMMSPI_DMA_TRIG_RX_MIS_RTOUT_OFS     (9)                             /* !< RTOUT Offset */
#define UNICOMMSPI_DMA_TRIG_RX_MIS_RTOUT_MASK    ((uint32_t)0x00000200U)         /* !< SPI Receive Time-Out event mask. */
#define UNICOMMSPI_DMA_TRIG_RX_MIS_RTOUT_CLR     ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMSPI_DMA_TRIG_RX_MIS_RTOUT_SET     ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */

/* UNICOMMSPI_DMA_TRIG_RX_ISET Bits */
/* UNICOMMSPI_DMA_TRIG_RX_ISET[RX] Bits */
#define UNICOMMSPI_DMA_TRIG_RX_ISET_RX_OFS       (2)                             /* !< RX Offset */
#define UNICOMMSPI_DMA_TRIG_RX_ISET_RX_MASK      ((uint32_t)0x00000004U)         /* !< Set Receive FIFO event. */
#define UNICOMMSPI_DMA_TRIG_RX_ISET_RX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMSPI_DMA_TRIG_RX_ISET_RX_SET       ((uint32_t)0x00000004U)         /* !< Set Interrupt */
/* UNICOMMSPI_DMA_TRIG_RX_ISET[RTOUT] Bits */
#define UNICOMMSPI_DMA_TRIG_RX_ISET_RTOUT_OFS    (9)                             /* !< RTOUT Offset */
#define UNICOMMSPI_DMA_TRIG_RX_ISET_RTOUT_MASK   ((uint32_t)0x00000200U)         /* !< Set SPI Receive Time-Out event. */
#define UNICOMMSPI_DMA_TRIG_RX_ISET_RTOUT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMSPI_DMA_TRIG_RX_ISET_RTOUT_SET    ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */

/* UNICOMMSPI_IIDX Bits */
/* UNICOMMSPI_IIDX[STAT] Bits */
#define UNICOMMSPI_IIDX_STAT_OFS                 (0)                             /* !< STAT Offset */
#define UNICOMMSPI_IIDX_STAT_MASK                ((uint32_t)0x000000FFU)         /* !< Interrupt index status */
#define UNICOMMSPI_IIDX_STAT_NO_INTR             ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define UNICOMMSPI_IIDX_STAT_PER_EVT             ((uint32_t)0x00000001U)         /* !< Transmit Parity Event/interrupt
                                                                                    pending */
#define UNICOMMSPI_IIDX_STAT_RXFIFO_OFV_EVT      ((uint32_t)0x00000002U)         /* !< RX FIFO Overflow Event/interrupt
                                                                                    pending */
#define UNICOMMSPI_IIDX_STAT_RX_EVT              ((uint32_t)0x00000003U)         /* !< Receive interrupt */
#define UNICOMMSPI_IIDX_STAT_RXFULL_EVT          ((uint32_t)0x00000004U)         /* !< RX FIFO Full Interrupt */
#define UNICOMMSPI_IIDX_STAT_TXFIFO_UNF_EVT      ((uint32_t)0x00000005U)         /* !< TX FIFO underflow interrupt */
#define UNICOMMSPI_IIDX_STAT_TX_EVT              ((uint32_t)0x00000006U)         /* !< Transmit Event */
#define UNICOMMSPI_IIDX_STAT_TX_EMPTY            ((uint32_t)0x00000007U)         /* !< Transmit Buffer Empty
                                                                                    Event/interrupt pending */
#define UNICOMMSPI_IIDX_STAT_IDLE_EVT            ((uint32_t)0x00000009U)         /* !< End of Transmit Event/interrupt
                                                                                    pending */
#define UNICOMMSPI_IIDX_STAT_RTOUT_EVT           ((uint32_t)0x0000000AU)         /* !< SPI receive time-out interrupt */
#define UNICOMMSPI_IIDX_STAT_DMA_DONE_RX         ((uint32_t)0x00000010U)         /* !< DMA DONE on RX */
#define UNICOMMSPI_IIDX_STAT_DMA_DONE_TX         ((uint32_t)0x00000011U)         /* !< DMA DONE on TX */
#define UNICOMMSPI_IIDX_STAT_DMA_PREIRQ_RX       ((uint32_t)0x00000013U)         /* !< DMA PRE IRQ RX INTERRUPT */
#define UNICOMMSPI_IIDX_STAT_DMA_PREIRQ_TX       ((uint32_t)0x00000014U)         /* !< DMA PRE IRQ TX INTERRUPT */
#define UNICOMMSPI_IIDX_STAT_LTOUT               ((uint32_t)0x00000015U)         /* !< SPI line time-out interrupt */

/* UNICOMMSPI_CPU_INT_IMASK Bits */
/* UNICOMMSPI_CPU_INT_IMASK[RX] Bits */
#define UNICOMMSPI_CPU_INT_IMASK_RX_OFS          (2)                             /* !< RX Offset */
#define UNICOMMSPI_CPU_INT_IMASK_RX_MASK         ((uint32_t)0x00000004U)         /* !< Mask Receive Event */
#define UNICOMMSPI_CPU_INT_IMASK_RX_CLR          ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMSPI_CPU_INT_IMASK_RX_SET          ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* UNICOMMSPI_CPU_INT_IMASK[TX] Bits */
#define UNICOMMSPI_CPU_INT_IMASK_TX_OFS          (5)                             /* !< TX Offset */
#define UNICOMMSPI_CPU_INT_IMASK_TX_MASK         ((uint32_t)0x00000020U)         /* !< Mask Transmit Event */
#define UNICOMMSPI_CPU_INT_IMASK_TX_CLR          ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMSPI_CPU_INT_IMASK_TX_SET          ((uint32_t)0x00000020U)         /* !< Set Interrupt Mask */
/* UNICOMMSPI_CPU_INT_IMASK[TXEMPTY] Bits */
#define UNICOMMSPI_CPU_INT_IMASK_TXEMPTY_OFS     (6)                             /* !< TXEMPTY Offset */
#define UNICOMMSPI_CPU_INT_IMASK_TXEMPTY_MASK    ((uint32_t)0x00000040U)         /* !< Transmit FIFO Empty event mask. */
#define UNICOMMSPI_CPU_INT_IMASK_TXEMPTY_CLR     ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMSPI_CPU_INT_IMASK_TXEMPTY_SET     ((uint32_t)0x00000040U)         /* !< Set Interrupt Mask */
/* UNICOMMSPI_CPU_INT_IMASK[PER] Bits */
#define UNICOMMSPI_CPU_INT_IMASK_PER_OFS         (0)                             /* !< PER Offset */
#define UNICOMMSPI_CPU_INT_IMASK_PER_MASK        ((uint32_t)0x00000001U)         /* !< Parity error event mask. */
#define UNICOMMSPI_CPU_INT_IMASK_PER_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMSPI_CPU_INT_IMASK_PER_SET         ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* UNICOMMSPI_CPU_INT_IMASK[RXFIFO_OVF] Bits */
#define UNICOMMSPI_CPU_INT_IMASK_RXFIFO_OVF_OFS  (1)                             /* !< RXFIFO_OVF Offset */
#define UNICOMMSPI_CPU_INT_IMASK_RXFIFO_OVF_MASK ((uint32_t)0x00000002U)         /* !< RXFIFO overflow event mask. */
#define UNICOMMSPI_CPU_INT_IMASK_RXFIFO_OVF_CLR  ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMSPI_CPU_INT_IMASK_RXFIFO_OVF_SET  ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* UNICOMMSPI_CPU_INT_IMASK[IDLE] Bits */
#define UNICOMMSPI_CPU_INT_IMASK_IDLE_OFS        (8)                             /* !< IDLE Offset */
#define UNICOMMSPI_CPU_INT_IMASK_IDLE_MASK       ((uint32_t)0x00000100U)         /* !< SPI Idle event mask. */
#define UNICOMMSPI_CPU_INT_IMASK_IDLE_CLR        ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMSPI_CPU_INT_IMASK_IDLE_SET        ((uint32_t)0x00000100U)         /* !< Set Interrupt Mask */
/* UNICOMMSPI_CPU_INT_IMASK[RTOUT] Bits */
#define UNICOMMSPI_CPU_INT_IMASK_RTOUT_OFS       (9)                             /* !< RTOUT Offset */
#define UNICOMMSPI_CPU_INT_IMASK_RTOUT_MASK      ((uint32_t)0x00000200U)         /* !< Enable SPI Receive Time-Out event
                                                                                    mask. */
#define UNICOMMSPI_CPU_INT_IMASK_RTOUT_CLR       ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMSPI_CPU_INT_IMASK_RTOUT_SET       ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */
/* UNICOMMSPI_CPU_INT_IMASK[RXFULL] Bits */
#define UNICOMMSPI_CPU_INT_IMASK_RXFULL_OFS      (3)                             /* !< RXFULL Offset */
#define UNICOMMSPI_CPU_INT_IMASK_RXFULL_MASK     ((uint32_t)0x00000008U)         /* !< RX FIFO Full Interrupt Mask */
#define UNICOMMSPI_CPU_INT_IMASK_RXFULL_CLR      ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMSPI_CPU_INT_IMASK_RXFULL_SET      ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* UNICOMMSPI_CPU_INT_IMASK[TXFIFO_UNF] Bits */
#define UNICOMMSPI_CPU_INT_IMASK_TXFIFO_UNF_OFS  (4)                             /* !< TXFIFO_UNF Offset */
#define UNICOMMSPI_CPU_INT_IMASK_TXFIFO_UNF_MASK ((uint32_t)0x00000010U)         /* !< TX FIFO underflow interrupt mask */
#define UNICOMMSPI_CPU_INT_IMASK_TXFIFO_UNF_CLR  ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMSPI_CPU_INT_IMASK_TXFIFO_UNF_SET  ((uint32_t)0x00000010U)         /* !< Set Interrupt Mask */
/* UNICOMMSPI_CPU_INT_IMASK[DMA_DONE_RX] Bits */
#define UNICOMMSPI_CPU_INT_IMASK_DMA_DONE_RX_OFS (15)                            /* !< DMA_DONE_RX Offset */
#define UNICOMMSPI_CPU_INT_IMASK_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< Enable DMA Done on RX Event Channel
                                                                                    Interrupt */
#define UNICOMMSPI_CPU_INT_IMASK_DMA_DONE_RX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMSPI_CPU_INT_IMASK_DMA_DONE_RX_SET ((uint32_t)0x00008000U)         /* !< Set Interrupt Mask */
/* UNICOMMSPI_CPU_INT_IMASK[DMA_DONE_TX] Bits */
#define UNICOMMSPI_CPU_INT_IMASK_DMA_DONE_TX_OFS (16)                            /* !< DMA_DONE_TX Offset */
#define UNICOMMSPI_CPU_INT_IMASK_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< Enable DMA Done on TX Event Channel
                                                                                    Interrupt */
#define UNICOMMSPI_CPU_INT_IMASK_DMA_DONE_TX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMSPI_CPU_INT_IMASK_DMA_DONE_TX_SET ((uint32_t)0x00010000U)         /* !< Set Interrupt Mask */
/* UNICOMMSPI_CPU_INT_IMASK[DMA_PREIRQ_RX] Bits */
#define UNICOMMSPI_CPU_INT_IMASK_DMA_PREIRQ_RX_OFS (18)                            /* !< DMA_PREIRQ_RX Offset */
#define UNICOMMSPI_CPU_INT_IMASK_DMA_PREIRQ_RX_MASK ((uint32_t)0x00040000U)         /* !< Enable DMA Done PREIRQ RX interrupt */
#define UNICOMMSPI_CPU_INT_IMASK_DMA_PREIRQ_RX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMSPI_CPU_INT_IMASK_DMA_PREIRQ_RX_SET ((uint32_t)0x00040000U)         /* !< Set Interrupt Mask */
/* UNICOMMSPI_CPU_INT_IMASK[DMA_PREIRQ_TX] Bits */
#define UNICOMMSPI_CPU_INT_IMASK_DMA_PREIRQ_TX_OFS (19)                            /* !< DMA_PREIRQ_TX Offset */
#define UNICOMMSPI_CPU_INT_IMASK_DMA_PREIRQ_TX_MASK ((uint32_t)0x00080000U)         /* !< Enable DMA Done PREIRQ TX interrupt */
#define UNICOMMSPI_CPU_INT_IMASK_DMA_PREIRQ_TX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMSPI_CPU_INT_IMASK_DMA_PREIRQ_TX_SET ((uint32_t)0x00080000U)         /* !< Set Interrupt Mask */
/* UNICOMMSPI_CPU_INT_IMASK[LTOUT] Bits */
#define UNICOMMSPI_CPU_INT_IMASK_LTOUT_OFS       (20)                            /* !< LTOUT Offset */
#define UNICOMMSPI_CPU_INT_IMASK_LTOUT_MASK      ((uint32_t)0x00100000U)         /* !< Enable SPI Line Time-Out event
                                                                                    mask. */
#define UNICOMMSPI_CPU_INT_IMASK_LTOUT_CLR       ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMSPI_CPU_INT_IMASK_LTOUT_SET       ((uint32_t)0x00100000U)         /* !< Set Interrupt Mask */

