TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/hw_unicommspi.h
/* UNICOMMSPI_CPU_INT_RIS Bits */
/* UNICOMMSPI_CPU_INT_RIS[RX] Bits */
#define UNICOMMSPI_CPU_INT_RIS_RX_OFS            (2)                             /* !< RX Offset */
#define UNICOMMSPI_CPU_INT_RIS_RX_MASK           ((uint32_t)0x00000004U)         /* !< Receive event When FIFO is present,
                                                                                    this bit is set when FIFO threshold
                                                                                    is reached When FIFO is not present,
                                                                                    this bit is set when a frame is
                                                                                    received */
#define UNICOMMSPI_CPU_INT_RIS_RX_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMSPI_CPU_INT_RIS_RX_SET            ((uint32_t)0x00000004U)         /* !< Interrupt occurred */
/* UNICOMMSPI_CPU_INT_RIS[TX] Bits */
#define UNICOMMSPI_CPU_INT_RIS_TX_OFS            (5)                             /* !< TX Offset */
#define UNICOMMSPI_CPU_INT_RIS_TX_MASK           ((uint32_t)0x00000020U)         /* !< Transmit event When FIFO is
                                                                                    present, this bit is set when Tx FIFO
                                                                                    threshold is reached When FIFO is not
                                                                                    present, this bit is set when tx
                                                                                    buffer is empty */
#define UNICOMMSPI_CPU_INT_RIS_TX_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMSPI_CPU_INT_RIS_TX_SET            ((uint32_t)0x00000020U)         /* !< Interrupt occurred */
/* UNICOMMSPI_CPU_INT_RIS[TXEMPTY] Bits */
#define UNICOMMSPI_CPU_INT_RIS_TXEMPTY_OFS       (6)                             /* !< TXEMPTY Offset */
#define UNICOMMSPI_CPU_INT_RIS_TXEMPTY_MASK      ((uint32_t)0x00000040U)         /* !< Transmit FIFO Empty interrupt mask.
                                                                                    This interrupt is set if all data in
                                                                                    the Transmit FIFO have been move to
                                                                                    the shift register. */
#define UNICOMMSPI_CPU_INT_RIS_TXEMPTY_CLR       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMSPI_CPU_INT_RIS_TXEMPTY_SET       ((uint32_t)0x00000040U)         /* !< Interrupt occurred */
/* UNICOMMSPI_CPU_INT_RIS[PER] Bits */
#define UNICOMMSPI_CPU_INT_RIS_PER_OFS           (0)                             /* !< PER Offset */
#define UNICOMMSPI_CPU_INT_RIS_PER_MASK          ((uint32_t)0x00000001U)         /* !< Parity error event: this bit is set
                                                                                    if a Parity error has been detected */
#define UNICOMMSPI_CPU_INT_RIS_PER_CLR           ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMSPI_CPU_INT_RIS_PER_SET           ((uint32_t)0x00000001U)         /* !< Interrupt occurred */
/* UNICOMMSPI_CPU_INT_RIS[RXFIFO_OVF] Bits */
#define UNICOMMSPI_CPU_INT_RIS_RXFIFO_OVF_OFS    (1)                             /* !< RXFIFO_OVF Offset */
#define UNICOMMSPI_CPU_INT_RIS_RXFIFO_OVF_MASK   ((uint32_t)0x00000002U)         /* !< RXFIFO overflow event. This
                                                                                    interrupt is set if an RX FIFO
                                                                                    overflow has been detected. */
#define UNICOMMSPI_CPU_INT_RIS_RXFIFO_OVF_CLR    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMSPI_CPU_INT_RIS_RXFIFO_OVF_SET    ((uint32_t)0x00000002U)         /* !< Interrupt occurred */
/* UNICOMMSPI_CPU_INT_RIS[IDLE] Bits */
#define UNICOMMSPI_CPU_INT_RIS_IDLE_OFS          (8)                             /* !< IDLE Offset */
#define UNICOMMSPI_CPU_INT_RIS_IDLE_MASK         ((uint32_t)0x00000100U)         /* !< SPI has done finished transfers and
                                                                                    changed into IDLE mode. This bit is
                                                                                    set when BUSY goes low. */
#define UNICOMMSPI_CPU_INT_RIS_IDLE_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMSPI_CPU_INT_RIS_IDLE_SET          ((uint32_t)0x00000100U)         /* !< Interrupt occurred */
/* UNICOMMSPI_CPU_INT_RIS[RTOUT] Bits */
#define UNICOMMSPI_CPU_INT_RIS_RTOUT_OFS         (9)                             /* !< RTOUT Offset */
#define UNICOMMSPI_CPU_INT_RIS_RTOUT_MASK        ((uint32_t)0x00000200U)         /* !< SPI Receive Time-Out event.  This
                                                                                    bit is set when there is still
                                                                                    contents in the FIFO after the
                                                                                    timeout period */
#define UNICOMMSPI_CPU_INT_RIS_RTOUT_CLR         ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMSPI_CPU_INT_RIS_RTOUT_SET         ((uint32_t)0x00000200U)         /* !< Interrupt occurred */
/* UNICOMMSPI_CPU_INT_RIS[TXFIFO_UNF] Bits */
#define UNICOMMSPI_CPU_INT_RIS_TXFIFO_UNF_OFS    (4)                             /* !< TXFIFO_UNF Offset */
#define UNICOMMSPI_CPU_INT_RIS_TXFIFO_UNF_MASK   ((uint32_t)0x00000010U)         /* !< TX FIFO Underflow Interrupt */
#define UNICOMMSPI_CPU_INT_RIS_TXFIFO_UNF_CLR    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMSPI_CPU_INT_RIS_TXFIFO_UNF_SET    ((uint32_t)0x00000010U)         /* !< Interrupt occurred */
/* UNICOMMSPI_CPU_INT_RIS[RXFULL] Bits */
#define UNICOMMSPI_CPU_INT_RIS_RXFULL_OFS        (3)                             /* !< RXFULL Offset */
#define UNICOMMSPI_CPU_INT_RIS_RXFULL_MASK       ((uint32_t)0x00000008U)         /* !< RX FIFO Full Interrupt */
#define UNICOMMSPI_CPU_INT_RIS_RXFULL_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMSPI_CPU_INT_RIS_RXFULL_SET        ((uint32_t)0x00000008U)         /* !< Interrupt occurred */
/* UNICOMMSPI_CPU_INT_RIS[DMA_DONE_RX] Bits */
#define UNICOMMSPI_CPU_INT_RIS_DMA_DONE_RX_OFS   (15)                            /* !< DMA_DONE_RX Offset */
#define UNICOMMSPI_CPU_INT_RIS_DMA_DONE_RX_MASK  ((uint32_t)0x00008000U)         /* !< DMA Done on RX Event Channel
                                                                                    Interrupt */
#define UNICOMMSPI_CPU_INT_RIS_DMA_DONE_RX_CLR   ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMSPI_CPU_INT_RIS_DMA_DONE_RX_SET   ((uint32_t)0x00008000U)         /* !< Interrupt occured */
/* UNICOMMSPI_CPU_INT_RIS[DMA_DONE_TX] Bits */
#define UNICOMMSPI_CPU_INT_RIS_DMA_DONE_TX_OFS   (16)                            /* !< DMA_DONE_TX Offset */
#define UNICOMMSPI_CPU_INT_RIS_DMA_DONE_TX_MASK  ((uint32_t)0x00010000U)         /* !< DMA Done on TX Event Channel
                                                                                    Interrupt */
#define UNICOMMSPI_CPU_INT_RIS_DMA_DONE_TX_CLR   ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMSPI_CPU_INT_RIS_DMA_DONE_TX_SET   ((uint32_t)0x00010000U)         /* !< Interrupt occured */
/* UNICOMMSPI_CPU_INT_RIS[DMA_PREIRQ_RX] Bits */
#define UNICOMMSPI_CPU_INT_RIS_DMA_PREIRQ_RX_OFS (18)                            /* !< DMA_PREIRQ_RX Offset */
#define UNICOMMSPI_CPU_INT_RIS_DMA_PREIRQ_RX_MASK ((uint32_t)0x00040000U)         /* !< DMA Done on RX Event Channel
                                                                                    Interrupt */
#define UNICOMMSPI_CPU_INT_RIS_DMA_PREIRQ_RX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMSPI_CPU_INT_RIS_DMA_PREIRQ_RX_SET ((uint32_t)0x00040000U)         /* !< Interrupt occured */
/* UNICOMMSPI_CPU_INT_RIS[DMA_PREIRQ_TX] Bits */
#define UNICOMMSPI_CPU_INT_RIS_DMA_PREIRQ_TX_OFS (19)                            /* !< DMA_PREIRQ_TX Offset */
#define UNICOMMSPI_CPU_INT_RIS_DMA_PREIRQ_TX_MASK ((uint32_t)0x00080000U)         /* !< DMA Done on RX Event Channel
                                                                                    Interrupt */
#define UNICOMMSPI_CPU_INT_RIS_DMA_PREIRQ_TX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMSPI_CPU_INT_RIS_DMA_PREIRQ_TX_SET ((uint32_t)0x00080000U)         /* !< Interrupt occured */
/* UNICOMMSPI_CPU_INT_RIS[LTOUT] Bits */
#define UNICOMMSPI_CPU_INT_RIS_LTOUT_OFS         (20)                            /* !< LTOUT Offset */
#define UNICOMMSPI_CPU_INT_RIS_LTOUT_MASK        ((uint32_t)0x00100000U)         /* !< SPI Line Time-Out event.  This bit
                                                                                    is set after timeout period has
                                                                                    lapsed */
#define UNICOMMSPI_CPU_INT_RIS_LTOUT_CLR         ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMSPI_CPU_INT_RIS_LTOUT_SET         ((uint32_t)0x00100000U)         /* !< Interrupt occurred */

/* UNICOMMSPI_CPU_INT_MIS Bits */
/* UNICOMMSPI_CPU_INT_MIS[RX] Bits */
#define UNICOMMSPI_CPU_INT_MIS_RX_OFS            (2)                             /* !< RX Offset */
#define UNICOMMSPI_CPU_INT_MIS_RX_MASK           ((uint32_t)0x00000004U)         /* !< Masked Receive Event */
#define UNICOMMSPI_CPU_INT_MIS_RX_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMSPI_CPU_INT_MIS_RX_SET            ((uint32_t)0x00000004U)         /* !< Interrupt occurred */
/* UNICOMMSPI_CPU_INT_MIS[TX] Bits */
#define UNICOMMSPI_CPU_INT_MIS_TX_OFS            (5)                             /* !< TX Offset */
#define UNICOMMSPI_CPU_INT_MIS_TX_MASK           ((uint32_t)0x00000020U)         /* !< Masked Transmit FIFO event. This
                                                                                    interrupt is set if the selected
                                                                                    Transmit FIFO level has been reached. */
#define UNICOMMSPI_CPU_INT_MIS_TX_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMSPI_CPU_INT_MIS_TX_SET            ((uint32_t)0x00000020U)         /* !< Interrupt occurred */
/* UNICOMMSPI_CPU_INT_MIS[TXEMPTY] Bits */
#define UNICOMMSPI_CPU_INT_MIS_TXEMPTY_OFS       (6)                             /* !< TXEMPTY Offset */
#define UNICOMMSPI_CPU_INT_MIS_TXEMPTY_MASK      ((uint32_t)0x00000040U)         /* !< Masked Transmit FIFO Empty event. */
#define UNICOMMSPI_CPU_INT_MIS_TXEMPTY_CLR       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMSPI_CPU_INT_MIS_TXEMPTY_SET       ((uint32_t)0x00000040U)         /* !< Interrupt occurred */
/* UNICOMMSPI_CPU_INT_MIS[PER] Bits */
#define UNICOMMSPI_CPU_INT_MIS_PER_OFS           (0)                             /* !< PER Offset */
#define UNICOMMSPI_CPU_INT_MIS_PER_MASK          ((uint32_t)0x00000001U)         /* !< Masked Parity error event: this bit
                                                                                    if a Parity error has been detected */
#define UNICOMMSPI_CPU_INT_MIS_PER_CLR           ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMSPI_CPU_INT_MIS_PER_SET           ((uint32_t)0x00000001U)         /* !< Interrupt occurred */
/* UNICOMMSPI_CPU_INT_MIS[RXFIFO_OVF] Bits */
#define UNICOMMSPI_CPU_INT_MIS_RXFIFO_OVF_OFS    (1)                             /* !< RXFIFO_OVF Offset */
#define UNICOMMSPI_CPU_INT_MIS_RXFIFO_OVF_MASK   ((uint32_t)0x00000002U)         /* !< Masked RXFIFO overflow event. This
                                                                                    interrupt is set if an RX FIFO
                                                                                    overflow has been detected. */
#define UNICOMMSPI_CPU_INT_MIS_RXFIFO_OVF_CLR    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMSPI_CPU_INT_MIS_RXFIFO_OVF_SET    ((uint32_t)0x00000002U)         /* !< Interrupt occurred */
/* UNICOMMSPI_CPU_INT_MIS[IDLE] Bits */
#define UNICOMMSPI_CPU_INT_MIS_IDLE_OFS          (8)                             /* !< IDLE Offset */
#define UNICOMMSPI_CPU_INT_MIS_IDLE_MASK         ((uint32_t)0x00000100U)         /* !< Masked SPI IDLE mode event. */
#define UNICOMMSPI_CPU_INT_MIS_IDLE_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMSPI_CPU_INT_MIS_IDLE_SET          ((uint32_t)0x00000100U)         /* !< Interrupt occurred */
/* UNICOMMSPI_CPU_INT_MIS[RTOUT] Bits */
#define UNICOMMSPI_CPU_INT_MIS_RTOUT_OFS         (9)                             /* !< RTOUT Offset */
#define UNICOMMSPI_CPU_INT_MIS_RTOUT_MASK        ((uint32_t)0x00000200U)         /* !< Masked SPI Receive Time-Out
                                                                                    Interrupt. */
#define UNICOMMSPI_CPU_INT_MIS_RTOUT_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMSPI_CPU_INT_MIS_RTOUT_SET         ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */
/* UNICOMMSPI_CPU_INT_MIS[RXFULL] Bits */
#define UNICOMMSPI_CPU_INT_MIS_RXFULL_OFS        (3)                             /* !< RXFULL Offset */
#define UNICOMMSPI_CPU_INT_MIS_RXFULL_MASK       ((uint32_t)0x00000008U)         /* !< RX FIFO Full Interrupt */
#define UNICOMMSPI_CPU_INT_MIS_RXFULL_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMSPI_CPU_INT_MIS_RXFULL_SET        ((uint32_t)0x00000008U)         /* !< Interrupt occurred */
/* UNICOMMSPI_CPU_INT_MIS[TXFIFO_UNF] Bits */
#define UNICOMMSPI_CPU_INT_MIS_TXFIFO_UNF_OFS    (4)                             /* !< TXFIFO_UNF Offset */
#define UNICOMMSPI_CPU_INT_MIS_TXFIFO_UNF_MASK   ((uint32_t)0x00000010U)         /* !< TX FIFO underflow interrupt */
#define UNICOMMSPI_CPU_INT_MIS_TXFIFO_UNF_CLR    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMSPI_CPU_INT_MIS_TXFIFO_UNF_SET    ((uint32_t)0x00000010U)         /* !< Interrupt occurred */
/* UNICOMMSPI_CPU_INT_MIS[DMA_DONE_RX] Bits */
#define UNICOMMSPI_CPU_INT_MIS_DMA_DONE_RX_OFS   (15)                            /* !< DMA_DONE_RX Offset */
#define UNICOMMSPI_CPU_INT_MIS_DMA_DONE_RX_MASK  ((uint32_t)0x00008000U)         /* !< Masked DMA Done on RX Event Channel
                                                                                    Interrupt */
#define UNICOMMSPI_CPU_INT_MIS_DMA_DONE_RX_CLR   ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMSPI_CPU_INT_MIS_DMA_DONE_RX_SET   ((uint32_t)0x00008000U)         /* !< Interrupt occured */
/* UNICOMMSPI_CPU_INT_MIS[DMA_DONE_TX] Bits */
#define UNICOMMSPI_CPU_INT_MIS_DMA_DONE_TX_OFS   (16)                            /* !< DMA_DONE_TX Offset */
#define UNICOMMSPI_CPU_INT_MIS_DMA_DONE_TX_MASK  ((uint32_t)0x00010000U)         /* !< Masked DMA Done on TX Event Channel
                                                                                    Interrupt */
#define UNICOMMSPI_CPU_INT_MIS_DMA_DONE_TX_CLR   ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMSPI_CPU_INT_MIS_DMA_DONE_TX_SET   ((uint32_t)0x00010000U)         /* !< Interrupt occured */
/* UNICOMMSPI_CPU_INT_MIS[DMA_PREIRQ_RX] Bits */
#define UNICOMMSPI_CPU_INT_MIS_DMA_PREIRQ_RX_OFS (19)                            /* !< DMA_PREIRQ_RX Offset */
#define UNICOMMSPI_CPU_INT_MIS_DMA_PREIRQ_RX_MASK ((uint32_t)0x00080000U)         /* !< Masked DMA PREIRQ Done on RX Event
                                                                                    Channel Interrupt */
#define UNICOMMSPI_CPU_INT_MIS_DMA_PREIRQ_RX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMSPI_CPU_INT_MIS_DMA_PREIRQ_RX_SET ((uint32_t)0x00080000U)         /* !< Interrupt occured */
/* UNICOMMSPI_CPU_INT_MIS[DMA_PREIRQ_TX] Bits */
#define UNICOMMSPI_CPU_INT_MIS_DMA_PREIRQ_TX_OFS (18)                            /* !< DMA_PREIRQ_TX Offset */
#define UNICOMMSPI_CPU_INT_MIS_DMA_PREIRQ_TX_MASK ((uint32_t)0x00040000U)         /* !< Masked DMA Done PREIRQ on TX Event
                                                                                    Channel Interrupt */
#define UNICOMMSPI_CPU_INT_MIS_DMA_PREIRQ_TX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMSPI_CPU_INT_MIS_DMA_PREIRQ_TX_SET ((uint32_t)0x00040000U)         /* !< Interrupt occured */
/* UNICOMMSPI_CPU_INT_MIS[LTOUT] Bits */
#define UNICOMMSPI_CPU_INT_MIS_LTOUT_OFS         (20)                            /* !< LTOUT Offset */
#define UNICOMMSPI_CPU_INT_MIS_LTOUT_MASK        ((uint32_t)0x00100000U)         /* !< Masked SPI Line Time-Out Interrupt. */
#define UNICOMMSPI_CPU_INT_MIS_LTOUT_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMSPI_CPU_INT_MIS_LTOUT_SET         ((uint32_t)0x00100000U)         /* !< Set Interrupt Mask */

