TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/hw_unicommspi.h
/* UNICOMMSPI_CPU_INT_ISET Bits */
/* UNICOMMSPI_CPU_INT_ISET[RX] Bits */
#define UNICOMMSPI_CPU_INT_ISET_RX_OFS           (2)                             /* !< RX Offset */
#define UNICOMMSPI_CPU_INT_ISET_RX_MASK          ((uint32_t)0x00000004U)         /* !< Set Receive event. */
#define UNICOMMSPI_CPU_INT_ISET_RX_NO_EFFECT     ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMSPI_CPU_INT_ISET_RX_SET           ((uint32_t)0x00000004U)         /* !< Set Interrupt */
/* UNICOMMSPI_CPU_INT_ISET[TX] Bits */
#define UNICOMMSPI_CPU_INT_ISET_TX_OFS           (5)                             /* !< TX Offset */
#define UNICOMMSPI_CPU_INT_ISET_TX_MASK          ((uint32_t)0x00000020U)         /* !< Set Transmit event. */
#define UNICOMMSPI_CPU_INT_ISET_TX_NO_EFFECT     ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMSPI_CPU_INT_ISET_TX_SET           ((uint32_t)0x00000020U)         /* !< Set Interrupt */
/* UNICOMMSPI_CPU_INT_ISET[TXEMPTY] Bits */
#define UNICOMMSPI_CPU_INT_ISET_TXEMPTY_OFS      (6)                             /* !< TXEMPTY Offset */
#define UNICOMMSPI_CPU_INT_ISET_TXEMPTY_MASK     ((uint32_t)0x00000040U)         /* !< Set Transmit FIFO Empty event. */
#define UNICOMMSPI_CPU_INT_ISET_TXEMPTY_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMSPI_CPU_INT_ISET_TXEMPTY_SET      ((uint32_t)0x00000040U)         /* !< Set Interrupt */
/* UNICOMMSPI_CPU_INT_ISET[PER] Bits */
#define UNICOMMSPI_CPU_INT_ISET_PER_OFS          (0)                             /* !< PER Offset */
#define UNICOMMSPI_CPU_INT_ISET_PER_MASK         ((uint32_t)0x00000001U)         /* !< Set Parity error event. */
#define UNICOMMSPI_CPU_INT_ISET_PER_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMSPI_CPU_INT_ISET_PER_SET          ((uint32_t)0x00000001U)         /* !< Set Interrupt */
/* UNICOMMSPI_CPU_INT_ISET[RXFIFO_OVF] Bits */
#define UNICOMMSPI_CPU_INT_ISET_RXFIFO_OVF_OFS   (1)                             /* !< RXFIFO_OVF Offset */
#define UNICOMMSPI_CPU_INT_ISET_RXFIFO_OVF_MASK  ((uint32_t)0x00000002U)         /* !< Set RXFIFO overflow event. */
#define UNICOMMSPI_CPU_INT_ISET_RXFIFO_OVF_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMSPI_CPU_INT_ISET_RXFIFO_OVF_SET   ((uint32_t)0x00000002U)         /* !< Set Interrupt */
/* UNICOMMSPI_CPU_INT_ISET[IDLE] Bits */
#define UNICOMMSPI_CPU_INT_ISET_IDLE_OFS         (8)                             /* !< IDLE Offset */
#define UNICOMMSPI_CPU_INT_ISET_IDLE_MASK        ((uint32_t)0x00000100U)         /* !< Set SPI IDLE mode event. */
#define UNICOMMSPI_CPU_INT_ISET_IDLE_NO_EFFECT   ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMSPI_CPU_INT_ISET_IDLE_SET         ((uint32_t)0x00000100U)         /* !< Set Interrupt */
/* UNICOMMSPI_CPU_INT_ISET[RTOUT] Bits */
#define UNICOMMSPI_CPU_INT_ISET_RTOUT_OFS        (9)                             /* !< RTOUT Offset */
#define UNICOMMSPI_CPU_INT_ISET_RTOUT_MASK       ((uint32_t)0x00000200U)         /* !< Set SPI Receive Time-Out Event. */
#define UNICOMMSPI_CPU_INT_ISET_RTOUT_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMSPI_CPU_INT_ISET_RTOUT_SET        ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */
/* UNICOMMSPI_CPU_INT_ISET[TXFIFO_UNF] Bits */
#define UNICOMMSPI_CPU_INT_ISET_TXFIFO_UNF_OFS   (4)                             /* !< TXFIFO_UNF Offset */
#define UNICOMMSPI_CPU_INT_ISET_TXFIFO_UNF_MASK  ((uint32_t)0x00000010U)         /* !< Set TX FIFO Underflow Event */
#define UNICOMMSPI_CPU_INT_ISET_TXFIFO_UNF_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing has no effect */
#define UNICOMMSPI_CPU_INT_ISET_TXFIFO_UNF_SET   ((uint32_t)0x00000010U)         /* !< Set interrupt */
/* UNICOMMSPI_CPU_INT_ISET[RXFULL] Bits */
#define UNICOMMSPI_CPU_INT_ISET_RXFULL_OFS       (3)                             /* !< RXFULL Offset */
#define UNICOMMSPI_CPU_INT_ISET_RXFULL_MASK      ((uint32_t)0x00000008U)         /* !< Set RX FIFO Full Event */
#define UNICOMMSPI_CPU_INT_ISET_RXFULL_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing has no effect */
#define UNICOMMSPI_CPU_INT_ISET_RXFULL_SET       ((uint32_t)0x00000008U)         /* !< Set Interrupt */
/* UNICOMMSPI_CPU_INT_ISET[DMA_DONE_RX] Bits */
#define UNICOMMSPI_CPU_INT_ISET_DMA_DONE_RX_OFS  (15)                            /* !< DMA_DONE_RX Offset */
#define UNICOMMSPI_CPU_INT_ISET_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< Set DMA Done on RX Event Channel
                                                                                    Interrupt */
#define UNICOMMSPI_CPU_INT_ISET_DMA_DONE_RX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMSPI_CPU_INT_ISET_DMA_DONE_RX_SET  ((uint32_t)0x00008000U)         /* !< Set Interrupt */
/* UNICOMMSPI_CPU_INT_ISET[DMA_DONE_TX] Bits */
#define UNICOMMSPI_CPU_INT_ISET_DMA_DONE_TX_OFS  (16)                            /* !< DMA_DONE_TX Offset */
#define UNICOMMSPI_CPU_INT_ISET_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< Set DMA Done on TX Event Channel
                                                                                    Interrupt */
#define UNICOMMSPI_CPU_INT_ISET_DMA_DONE_TX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMSPI_CPU_INT_ISET_DMA_DONE_TX_SET  ((uint32_t)0x00010000U)         /* !< Set Interrupt */
/* UNICOMMSPI_CPU_INT_ISET[DMA_PREIRQ_RX] Bits */
#define UNICOMMSPI_CPU_INT_ISET_DMA_PREIRQ_RX_OFS (18)                            /* !< DMA_PREIRQ_RX Offset */
#define UNICOMMSPI_CPU_INT_ISET_DMA_PREIRQ_RX_MASK ((uint32_t)0x00040000U)         /* !< Set DMA PREIRQ Done on RX Event
                                                                                    Channel Interrupt */
#define UNICOMMSPI_CPU_INT_ISET_DMA_PREIRQ_RX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMSPI_CPU_INT_ISET_DMA_PREIRQ_RX_SET ((uint32_t)0x00040000U)         /* !< Set Interrupt */
/* UNICOMMSPI_CPU_INT_ISET[DMA_PREIRQ_TX] Bits */
#define UNICOMMSPI_CPU_INT_ISET_DMA_PREIRQ_TX_OFS (19)                            /* !< DMA_PREIRQ_TX Offset */
#define UNICOMMSPI_CPU_INT_ISET_DMA_PREIRQ_TX_MASK ((uint32_t)0x00080000U)         /* !< Set DMA PREIRQ Done on TX Event
                                                                                    Channel Interrupt */
#define UNICOMMSPI_CPU_INT_ISET_DMA_PREIRQ_TX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMSPI_CPU_INT_ISET_DMA_PREIRQ_TX_SET ((uint32_t)0x00080000U)         /* !< Set Interrupt */
/* UNICOMMSPI_CPU_INT_ISET[LTOUT] Bits */
#define UNICOMMSPI_CPU_INT_ISET_LTOUT_OFS        (20)                            /* !< LTOUT Offset */
#define UNICOMMSPI_CPU_INT_ISET_LTOUT_MASK       ((uint32_t)0x00100000U)         /* !< Set SPI Line Time-Out Event. */
#define UNICOMMSPI_CPU_INT_ISET_LTOUT_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMSPI_CPU_INT_ISET_LTOUT_SET        ((uint32_t)0x00100000U)         /* !< Set Interrupt Mask */

/* UNICOMMSPI_ICLR Bits */
/* UNICOMMSPI_ICLR[RX] Bits */
#define UNICOMMSPI_ICLR_RX_OFS                   (2)                             /* !< RX Offset */
#define UNICOMMSPI_ICLR_RX_MASK                  ((uint32_t)0x00000004U)         /* !< Clear Receive event. */
#define UNICOMMSPI_ICLR_RX_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMSPI_ICLR_RX_CLR                   ((uint32_t)0x00000004U)         /* !< Clear Interrupt */
/* UNICOMMSPI_ICLR[TX] Bits */
#define UNICOMMSPI_ICLR_TX_OFS                   (5)                             /* !< TX Offset */
#define UNICOMMSPI_ICLR_TX_MASK                  ((uint32_t)0x00000020U)         /* !< Clear Transmit event. */
#define UNICOMMSPI_ICLR_TX_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMSPI_ICLR_TX_CLR                   ((uint32_t)0x00000020U)         /* !< Clear Interrupt */
/* UNICOMMSPI_ICLR[TXEMPTY] Bits */
#define UNICOMMSPI_ICLR_TXEMPTY_OFS              (6)                             /* !< TXEMPTY Offset */
#define UNICOMMSPI_ICLR_TXEMPTY_MASK             ((uint32_t)0x00000040U)         /* !< Clear Transmit FIFO Empty event. */
#define UNICOMMSPI_ICLR_TXEMPTY_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMSPI_ICLR_TXEMPTY_CLR              ((uint32_t)0x00000040U)         /* !< Clear Interrupt */
/* UNICOMMSPI_ICLR[PER] Bits */
#define UNICOMMSPI_ICLR_PER_OFS                  (0)                             /* !< PER Offset */
#define UNICOMMSPI_ICLR_PER_MASK                 ((uint32_t)0x00000001U)         /* !< Clear Parity error event. */
#define UNICOMMSPI_ICLR_PER_NO_EFFECT            ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMSPI_ICLR_PER_CLR                  ((uint32_t)0x00000001U)         /* !< Clear Interrupt */
/* UNICOMMSPI_ICLR[RXFIFO_OVF] Bits */
#define UNICOMMSPI_ICLR_RXFIFO_OVF_OFS           (1)                             /* !< RXFIFO_OVF Offset */
#define UNICOMMSPI_ICLR_RXFIFO_OVF_MASK          ((uint32_t)0x00000002U)         /* !< Clear RXFIFO overflow event. */
#define UNICOMMSPI_ICLR_RXFIFO_OVF_NO_EFFECT     ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMSPI_ICLR_RXFIFO_OVF_CLR           ((uint32_t)0x00000002U)         /* !< Clear Interrupt */
/* UNICOMMSPI_ICLR[IDLE] Bits */
#define UNICOMMSPI_ICLR_IDLE_OFS                 (8)                             /* !< IDLE Offset */
#define UNICOMMSPI_ICLR_IDLE_MASK                ((uint32_t)0x00000100U)         /* !< Clear SPI IDLE mode event. */
#define UNICOMMSPI_ICLR_IDLE_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMSPI_ICLR_IDLE_CLR                 ((uint32_t)0x00000100U)         /* !< Clear Interrupt */
/* UNICOMMSPI_ICLR[RTOUT] Bits */
#define UNICOMMSPI_ICLR_RTOUT_OFS                (9)                             /* !< RTOUT Offset */
#define UNICOMMSPI_ICLR_RTOUT_MASK               ((uint32_t)0x00000200U)         /* !< Clear SPI Receive Time-Out Event. */
#define UNICOMMSPI_ICLR_RTOUT_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMSPI_ICLR_RTOUT_CLR                ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */
/* UNICOMMSPI_ICLR[TXFIFO_UNF] Bits */
#define UNICOMMSPI_ICLR_TXFIFO_UNF_OFS           (4)                             /* !< TXFIFO_UNF Offset */
#define UNICOMMSPI_ICLR_TXFIFO_UNF_MASK          ((uint32_t)0x00000010U)         /* !< Clear TXFIFO underflow event */
#define UNICOMMSPI_ICLR_TXFIFO_UNF_NO_EFFECT     ((uint32_t)0x00000000U)         /* !< Writing has no effect */
#define UNICOMMSPI_ICLR_TXFIFO_UNF_CLR           ((uint32_t)0x00000010U)         /* !< Clear interrupt */
/* UNICOMMSPI_ICLR[RXFULL] Bits */
#define UNICOMMSPI_ICLR_RXFULL_OFS               (3)                             /* !< RXFULL Offset */
#define UNICOMMSPI_ICLR_RXFULL_MASK              ((uint32_t)0x00000008U)         /* !< Clear RX FIFO underflow event */
#define UNICOMMSPI_ICLR_RXFULL_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing has no effect */
#define UNICOMMSPI_ICLR_RXFULL_CLR               ((uint32_t)0x00000008U)         /* !< Clear interrupt */
/* UNICOMMSPI_ICLR[DMA_DONE_RX] Bits */
#define UNICOMMSPI_ICLR_DMA_DONE_RX_OFS          (15)                            /* !< DMA_DONE_RX Offset */
#define UNICOMMSPI_ICLR_DMA_DONE_RX_MASK         ((uint32_t)0x00008000U)         /* !< Clear DMA Done on RX Event Channel
                                                                                    Interrupt */
#define UNICOMMSPI_ICLR_DMA_DONE_RX_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMSPI_ICLR_DMA_DONE_RX_CLR          ((uint32_t)0x00008000U)         /* !< Clear Interrupt */
/* UNICOMMSPI_ICLR[DMA_DONE_TX] Bits */
#define UNICOMMSPI_ICLR_DMA_DONE_TX_OFS          (16)                            /* !< DMA_DONE_TX Offset */
#define UNICOMMSPI_ICLR_DMA_DONE_TX_MASK         ((uint32_t)0x00010000U)         /* !< Clear DMA Done on TX Event Channel
                                                                                    Interrupt */
#define UNICOMMSPI_ICLR_DMA_DONE_TX_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMSPI_ICLR_DMA_DONE_TX_CLR          ((uint32_t)0x00010000U)         /* !< Clear Interrupt */
/* UNICOMMSPI_ICLR[DMA_PREIRQ_RX] Bits */
#define UNICOMMSPI_ICLR_DMA_PREIRQ_RX_OFS        (18)                            /* !< DMA_PREIRQ_RX Offset */
#define UNICOMMSPI_ICLR_DMA_PREIRQ_RX_MASK       ((uint32_t)0x00040000U)         /* !< Clear DMA PREIRQ Done on RX Event
                                                                                    Channel Interrupt */
#define UNICOMMSPI_ICLR_DMA_PREIRQ_RX_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMSPI_ICLR_DMA_PREIRQ_RX_CLR        ((uint32_t)0x00040000U)         /* !< Clear Interrupt */
/* UNICOMMSPI_ICLR[DMA_PREIRQ_TX] Bits */
#define UNICOMMSPI_ICLR_DMA_PREIRQ_TX_OFS        (19)                            /* !< DMA_PREIRQ_TX Offset */
#define UNICOMMSPI_ICLR_DMA_PREIRQ_TX_MASK       ((uint32_t)0x00080000U)         /* !< Clear DMA PREIRQ Done on TX Event
                                                                                    Channel Interrupt */
#define UNICOMMSPI_ICLR_DMA_PREIRQ_TX_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMSPI_ICLR_DMA_PREIRQ_TX_CLR        ((uint32_t)0x00080000U)         /* !< Clear Interrupt */
/* UNICOMMSPI_ICLR[LTOUT] Bits */
#define UNICOMMSPI_ICLR_LTOUT_OFS                (20)                            /* !< LTOUT Offset */
#define UNICOMMSPI_ICLR_LTOUT_MASK               ((uint32_t)0x00100000U)         /* !< Clear SPI Line Time-Out Event. */
#define UNICOMMSPI_ICLR_LTOUT_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMSPI_ICLR_LTOUT_CLR                ((uint32_t)0x00100000U)         /* !< Set Interrupt Mask */

/* UNICOMMSPI_CLKDIV Bits */
/* UNICOMMSPI_CLKDIV[RATIO] Bits */
#define UNICOMMSPI_CLKDIV_RATIO_OFS              (0)                             /* !< RATIO Offset */
#define UNICOMMSPI_CLKDIV_RATIO_MASK             ((uint32_t)0x00000007U)         /* !< Selects divide ratio of module
                                                                                    clock */
#define UNICOMMSPI_CLKDIV_RATIO_DIV_BY_1         ((uint32_t)0x00000000U)         /* !< Do not divide clock source */
#define UNICOMMSPI_CLKDIV_RATIO_DIV_BY_2         ((uint32_t)0x00000001U)         /* !< Divide clock source by 2 */
#define UNICOMMSPI_CLKDIV_RATIO_DIV_BY_3         ((uint32_t)0x00000002U)         /* !< Divide clock source by 3 */
#define UNICOMMSPI_CLKDIV_RATIO_DIV_BY_4         ((uint32_t)0x00000003U)         /* !< Divide clock source by 4 */
#define UNICOMMSPI_CLKDIV_RATIO_DIV_BY_5         ((uint32_t)0x00000004U)         /* !< Divide clock source by 5 */
#define UNICOMMSPI_CLKDIV_RATIO_DIV_BY_6         ((uint32_t)0x00000005U)         /* !< Divide clock source by 6 */
#define UNICOMMSPI_CLKDIV_RATIO_DIV_BY_7         ((uint32_t)0x00000006U)         /* !< Divide clock source by 7 */
#define UNICOMMSPI_CLKDIV_RATIO_DIV_BY_8         ((uint32_t)0x00000007U)         /* !< Divide clock source by 8 */

