TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/hw_unicommspi.h
/* UNICOMMSPI_INTCTL Bits */
/* UNICOMMSPI_INTCTL[INTEVAL] Bits */
#define UNICOMMSPI_INTCTL_INTEVAL_OFS            (0)                             /* !< INTEVAL Offset */
#define UNICOMMSPI_INTCTL_INTEVAL_MASK           ((uint32_t)0x00000001U)         /* !< Writing a 1 to this field
                                                                                    re-evaluates the interrupt sources. */
#define UNICOMMSPI_INTCTL_INTEVAL_DISABLE        ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define UNICOMMSPI_INTCTL_INTEVAL_EVAL           ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */

/* UNICOMMSPI_CTL0 Bits */
/* UNICOMMSPI_CTL0[DSS] Bits */
#define UNICOMMSPI_CTL0_DSS_OFS                  (0)                             /* !< DSS Offset */
#define UNICOMMSPI_CTL0_DSS_MASK                 ((uint32_t)0x0000001FU)         /* !< Data Size Select. Values 0 - 2 are
                                                                                    reserved and shall not be used. 3h =
                                                                                    4_BIT : 4-bit data SPI allows only
                                                                                    values up to 16 Bit */
#define UNICOMMSPI_CTL0_DSS_DSS_4                ((uint32_t)0x00000003U)         /* !< Data Size Select bits: 4 */
#define UNICOMMSPI_CTL0_DSS_DSS_5                ((uint32_t)0x00000004U)         /* !< Data Size Select bits: 5 */
#define UNICOMMSPI_CTL0_DSS_DSS_6                ((uint32_t)0x00000005U)         /* !< Data Size Select bits: 6 */
#define UNICOMMSPI_CTL0_DSS_DSS_7                ((uint32_t)0x00000006U)         /* !< Data Size Select bits: 7 */
#define UNICOMMSPI_CTL0_DSS_DSS_8                ((uint32_t)0x00000007U)         /* !< Data Size Select bits: 8 */
#define UNICOMMSPI_CTL0_DSS_DSS_9                ((uint32_t)0x00000008U)         /* !< Data Size Select bits: 9 */
#define UNICOMMSPI_CTL0_DSS_DSS_10               ((uint32_t)0x00000009U)         /* !< Data Size Select bits: 10 */
#define UNICOMMSPI_CTL0_DSS_DSS_11               ((uint32_t)0x0000000AU)         /* !< Data Size Select bits: 11 */
#define UNICOMMSPI_CTL0_DSS_DSS_12               ((uint32_t)0x0000000BU)         /* !< Data Size Select bits: 12 */
#define UNICOMMSPI_CTL0_DSS_DSS_13               ((uint32_t)0x0000000CU)         /* !< Data Size Select bits: 13 */
#define UNICOMMSPI_CTL0_DSS_DSS_14               ((uint32_t)0x0000000DU)         /* !< Data Size Select bits: 14 */
#define UNICOMMSPI_CTL0_DSS_DSS_15               ((uint32_t)0x0000000EU)         /* !< Data Size Select bits: 15 */
#define UNICOMMSPI_CTL0_DSS_DSS_16               ((uint32_t)0x0000000FU)         /* !< Data Size Select bits: 16 */
/* UNICOMMSPI_CTL0[FRF] Bits */
#define UNICOMMSPI_CTL0_FRF_OFS                  (5)                             /* !< FRF Offset */
#define UNICOMMSPI_CTL0_FRF_MASK                 ((uint32_t)0x00000060U)         /* !< Frame format Select */
#define UNICOMMSPI_CTL0_FRF_MOTOROLA_3WIRE       ((uint32_t)0x00000000U)         /* !< Motorola SPI frame format (3 wire
                                                                                    mode) */
#define UNICOMMSPI_CTL0_FRF_MOTOROLA_4WIRE       ((uint32_t)0x00000020U)         /* !< Motorola SPI frame format (4 wire
                                                                                    mode) */
#define UNICOMMSPI_CTL0_FRF_TI_SYNC              ((uint32_t)0x00000040U)         /* !< TI synchronous serial frame format */
#define UNICOMMSPI_CTL0_FRF_MIRCOWIRE            ((uint32_t)0x00000060U)         /* !< National Microwire frame format */
/* UNICOMMSPI_CTL0[SPO] Bits */
#define UNICOMMSPI_CTL0_SPO_OFS                  (8)                             /* !< SPO Offset */
#define UNICOMMSPI_CTL0_SPO_MASK                 ((uint32_t)0x00000100U)         /* !< CLKOUT polarity (Motorola SPI frame
                                                                                    format only) */
#define UNICOMMSPI_CTL0_SPO_LOW                  ((uint32_t)0x00000000U)         /* !< SPI produces a steady state LOW
                                                                                    value on the CLKOUT */
#define UNICOMMSPI_CTL0_SPO_HIGH                 ((uint32_t)0x00000100U)         /* !< SPI produces a steady state HIGH
                                                                                    value on the CLKOUT */
/* UNICOMMSPI_CTL0[SPH] Bits */
#define UNICOMMSPI_CTL0_SPH_OFS                  (9)                             /* !< SPH Offset */
#define UNICOMMSPI_CTL0_SPH_MASK                 ((uint32_t)0x00000200U)         /* !< CLKOUT phase (Motorola SPI frame
                                                                                    format only) This bit selects the
                                                                                    clock edge that captures data and
                                                                                    enables it to change state. It has
                                                                                    the most impact on the first bit
                                                                                    transmitted by either permitting or
                                                                                    not permitting a clock transition
                                                                                    before the first data capture edge. */
#define UNICOMMSPI_CTL0_SPH_FIRST                ((uint32_t)0x00000000U)         /* !< Data is captured on the first clock
                                                                                    edge transition. */
#define UNICOMMSPI_CTL0_SPH_SECOND               ((uint32_t)0x00000200U)         /* !< Data is captured on the second
                                                                                    clock edge transition. */
/* UNICOMMSPI_CTL0[CSSEL] Bits */
#define UNICOMMSPI_CTL0_CSSEL_OFS                (12)                            /* !< CSSEL Offset */
#define UNICOMMSPI_CTL0_CSSEL_MASK               ((uint32_t)0x00003000U)         /* !< Select the CS line to control on
                                                                                    data transfer This bit is applicable
                                                                                    for both controller/target mode */
#define UNICOMMSPI_CTL0_CSSEL_CSSEL_0            ((uint32_t)0x00000000U)         /* !< CS line select: 0 */
#define UNICOMMSPI_CTL0_CSSEL_CSSEL_1            ((uint32_t)0x00001000U)         /* !< CS line select: 1 */
#define UNICOMMSPI_CTL0_CSSEL_CSSEL_2            ((uint32_t)0x00002000U)         /* !< CS line select: 2 */
#define UNICOMMSPI_CTL0_CSSEL_CSSEL_3            ((uint32_t)0x00003000U)         /* !< CS line select: 3 */
/* UNICOMMSPI_CTL0[CSCLR] Bits */
#define UNICOMMSPI_CTL0_CSCLR_OFS                (14)                            /* !< CSCLR Offset */
#define UNICOMMSPI_CTL0_CSCLR_MASK               ((uint32_t)0x00004000U)         /* !< Clear shift register counter on CS
                                                                                    inactive This bit is relevant only in
                                                                                    the peripheral, CTL1.CP=0. */
#define UNICOMMSPI_CTL0_CSCLR_DISABLE            ((uint32_t)0x00000000U)         /* !< Disable automatic clear of shift
                                                                                    register when CS goes to disable. */
#define UNICOMMSPI_CTL0_CSCLR_ENABLE             ((uint32_t)0x00004000U)         /* !< Enable automatic clear of shift
                                                                                    register when CS goes to disable. */
/* UNICOMMSPI_CTL0[PACKEN] Bits */
#define UNICOMMSPI_CTL0_PACKEN_OFS               (7)                             /* !< PACKEN Offset */
#define UNICOMMSPI_CTL0_PACKEN_MASK              ((uint32_t)0x00000080U)         /* !< Packing Enable. When 1, packing
                                                                                    feature is enabled inside the IP When
                                                                                    0, packing feature is disabled inside
                                                                                    the IP */
#define UNICOMMSPI_CTL0_PACKEN_DISABLED          ((uint32_t)0x00000000U)         /* !< Packing feature disabled */
#define UNICOMMSPI_CTL0_PACKEN_ENABLED           ((uint32_t)0x00000080U)         /* !< Packing feature enabled */

