TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/hw_unicommspi.h
/* UNICOMMSPI_RXDATA Bits */
/* UNICOMMSPI_RXDATA[DATA] Bits */
#define UNICOMMSPI_RXDATA_DATA_OFS               (0)                             /* !< DATA Offset */
#define UNICOMMSPI_RXDATA_DATA_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< Received Data When PACKEN=1,two
                                                                                    entries of the FIFO are returned as a
                                                                                    32-bit value. When PACKEN=0, 1 entry
                                                                                    of FIFO is returned as 16-bit value.
                                                                                    As data values are removed by the
                                                                                    receive logic from the incoming data
                                                                                    frame, they are placed into the entry
                                                                                    in the receive FIFO, pointed to by
                                                                                    the current FIFO write pointer.
                                                                                    Received data less than 16 bits is
                                                                                    automatically right justified in the
                                                                                    receive buffer. */
#define UNICOMMSPI_RXDATA_DATA_MINIMUM           ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMSPI_RXDATA_DATA_MAXIMUM           ((uint32_t)0xFFFFFFFFU)         /* !< Highest possible value */

/* UNICOMMSPI_CTL1 Bits */
/* UNICOMMSPI_CTL1[LBM] Bits */
#define UNICOMMSPI_CTL1_LBM_OFS                  (1)                             /* !< LBM Offset */
#define UNICOMMSPI_CTL1_LBM_MASK                 ((uint32_t)0x00000002U)         /* !< Loop back mode */
#define UNICOMMSPI_CTL1_LBM_DISABLE              ((uint32_t)0x00000000U)         /* !< Disable loopback mode */
#define UNICOMMSPI_CTL1_LBM_ENABLE               ((uint32_t)0x00000002U)         /* !< Enable loopback mode */
/* UNICOMMSPI_CTL1[CP] Bits */
#define UNICOMMSPI_CTL1_CP_OFS                   (2)                             /* !< CP Offset */
#define UNICOMMSPI_CTL1_CP_MASK                  ((uint32_t)0x00000004U)         /* !< Controller or peripheral mode
                                                                                    select. This bit can be modified only
                                                                                    when SPI is disabled, CTL1.ENABLE=0. */
#define UNICOMMSPI_CTL1_CP_DISABLE               ((uint32_t)0x00000000U)         /* !< Select Peripheral mode */
#define UNICOMMSPI_CTL1_CP_ENABLE                ((uint32_t)0x00000004U)         /* !< Select Controller Mode */
/* UNICOMMSPI_CTL1[POD] Bits */
#define UNICOMMSPI_CTL1_POD_OFS                  (3)                             /* !< POD Offset */
#define UNICOMMSPI_CTL1_POD_MASK                 ((uint32_t)0x00000008U)         /* !< Peripheral-mode: Data output
                                                                                    disabled This bit is relevant only in
                                                                                    Peripheral mode. In
                                                                                    multiple-peripheral system
                                                                                    topologies, SPI controller can
                                                                                    broadcast a message to all
                                                                                    peripherals, while only one
                                                                                    peripheral drives the line.  POD can
                                                                                    be used by the SPI peripheral to
                                                                                    disable driving data on the line. */
#define UNICOMMSPI_CTL1_POD_DISABLE              ((uint32_t)0x00000000U)         /* !< SPI can drive the POCI output in
                                                                                    peripheral mode. */
#define UNICOMMSPI_CTL1_POD_ENABLE               ((uint32_t)0x00000008U)         /* !< SPI cannot drive the POCI output in
                                                                                    peripheral mode. */
/* UNICOMMSPI_CTL1[MSB] Bits */
#define UNICOMMSPI_CTL1_MSB_OFS                  (4)                             /* !< MSB Offset */
#define UNICOMMSPI_CTL1_MSB_MASK                 ((uint32_t)0x00000010U)         /* !< MSB first select. Controls the
                                                                                    direction of the receive and transmit
                                                                                    shift register. */
#define UNICOMMSPI_CTL1_MSB_DISABLE              ((uint32_t)0x00000000U)         /* !< LSB first */
#define UNICOMMSPI_CTL1_MSB_ENABLE               ((uint32_t)0x00000010U)         /* !< MSB first */
/* UNICOMMSPI_CTL1[PREN] Bits */
#define UNICOMMSPI_CTL1_PREN_OFS                 (5)                             /* !< PREN Offset */
#define UNICOMMSPI_CTL1_PREN_MASK                ((uint32_t)0x00000020U)         /* !< Parity receive enable If enabled,
                                                                                    parity reception check will be done
                                                                                    for both controller and peripheral
                                                                                    modes In case of a parity miss-match
                                                                                    the parity error flag RIS.PER will be
                                                                                    set. */
#define UNICOMMSPI_CTL1_PREN_DISABLE             ((uint32_t)0x00000000U)         /* !< Disable Parity receive function */
#define UNICOMMSPI_CTL1_PREN_ENABLE              ((uint32_t)0x00000020U)         /* !< Enable Parity receive function */
/* UNICOMMSPI_CTL1[REPEATTX] Bits */
#define UNICOMMSPI_CTL1_REPEATTX_OFS             (16)                            /* !< REPEATTX Offset */
#define UNICOMMSPI_CTL1_REPEATTX_MASK            ((uint32_t)0x00FF0000U)         /* !< Counter to repeat last transfer 0:
                                                                                    repeat last transfer is disabled. x:
                                                                                    repeat the last transfer with the
                                                                                    given number. The transfer will be
                                                                                    started with writing a data into the
                                                                                    TX Buffer. Sending the data will be
                                                                                    repeated with the given value, so the
                                                                                    data will be transferred X+1 times in
                                                                                    total. The behavior is identical as
                                                                                    if the data would be written into the
                                                                                    TX Buffer that many times as defined
                                                                                    by the value here. It can be used to
                                                                                    clean a transfer or to pull a certain
                                                                                    amount of data by a peripheral. */
#define UNICOMMSPI_CTL1_REPEATTX_DISABLE         ((uint32_t)0x00000000U)         /* !< REPEATTX disable */
#define UNICOMMSPI_CTL1_REPEATTX_MINIMUM         ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMSPI_CTL1_REPEATTX_MAXIMUM         ((uint32_t)0x00FF0000U)         /* !< Highest possible value */
/* UNICOMMSPI_CTL1[PES] Bits */
#define UNICOMMSPI_CTL1_PES_OFS                  (6)                             /* !< PES Offset */
#define UNICOMMSPI_CTL1_PES_MASK                 ((uint32_t)0x00000040U)         /* !< Even Parity Select */
#define UNICOMMSPI_CTL1_PES_DISABLE              ((uint32_t)0x00000000U)         /* !< Odd Parity mode */
#define UNICOMMSPI_CTL1_PES_ENABLE               ((uint32_t)0x00000040U)         /* !< Even Parity mode */
/* UNICOMMSPI_CTL1[CDMODE] Bits */
#define UNICOMMSPI_CTL1_CDMODE_OFS               (12)                            /* !< CDMODE Offset */
#define UNICOMMSPI_CTL1_CDMODE_MASK              ((uint32_t)0x0000F000U)         /* !< Command/Data Mode Value  When
                                                                                    CTL1.CDENABLE is 1, CS3 line is used
                                                                                    as C/D signal to distinguish between
                                                                                    Command (C/D low) and Data (C/D high)
                                                                                    information.  When a value is written
                                                                                    into the CTL1.CDMODE bits, the C/D
                                                                                    (CS3) line will go low for the given
                                                                                    numbers of byte which are sent by the
                                                                                    SPI, starting with the next value to
                                                                                    be transmitted after which, C/D line
                                                                                    will go high automatically  0: Manual
                                                                                    mode with C/D signal as High 1-14:
                                                                                    C/D is low while this number of bytes
                                                                                    are being sent after which, this
                                                                                    field sets to 0 and C/D goes high.
                                                                                    Reading this field at any time
                                                                                    returns the remaining number of
                                                                                    command bytes. 15: Manual mode with
                                                                                    C/D signal as Low. */
#define UNICOMMSPI_CTL1_CDMODE_MINIMUM           ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMSPI_CTL1_CDMODE_DATA              ((uint32_t)0x00000000U)         /* !< Manual mode: Data */
#define UNICOMMSPI_CTL1_CDMODE_MAXIMUM           ((uint32_t)0x0000F000U)         /* !< Highest possible value */
#define UNICOMMSPI_CTL1_CDMODE_COMMAND           ((uint32_t)0x0000F000U)         /* !< Manual mode: Command */
/* UNICOMMSPI_CTL1[ENABLE] Bits */
#define UNICOMMSPI_CTL1_ENABLE_OFS               (0)                             /* !< ENABLE Offset */
#define UNICOMMSPI_CTL1_ENABLE_MASK              ((uint32_t)0x00000001U)         /* !< SPI enable */
#define UNICOMMSPI_CTL1_ENABLE_DISABLE           ((uint32_t)0x00000000U)         /* !< Disable module function */
#define UNICOMMSPI_CTL1_ENABLE_ENABLE            ((uint32_t)0x00000001U)         /* !< Enable module function */
/* UNICOMMSPI_CTL1[RXTIMEOUT] Bits */
#define UNICOMMSPI_CTL1_RXTIMEOUT_OFS            (24)                            /* !< RXTIMEOUT Offset */
#define UNICOMMSPI_CTL1_RXTIMEOUT_MASK           ((uint32_t)0x3F000000U)         /* !< Receive Timeout (only for
                                                                                    Peripheral mode) Defines the number
                                                                                    of Clock Cycles before after which
                                                                                    the Receive Timeout flag RTOUT is
                                                                                    set. The time is calculated using the
                                                                                    control register for the clock
                                                                                    selection and divider in the
                                                                                    Controller mode configuration. A
                                                                                    value of 0 disables this function. */
#define UNICOMMSPI_CTL1_RXTIMEOUT_MINIMUM        ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMSPI_CTL1_RXTIMEOUT_MAXIMUM        ((uint32_t)0x3F000000U)         /* !< Highest possible value */
/* UNICOMMSPI_CTL1[CDENABLE] Bits */
#define UNICOMMSPI_CTL1_CDENABLE_OFS             (11)                            /* !< CDENABLE Offset */
#define UNICOMMSPI_CTL1_CDENABLE_MASK            ((uint32_t)0x00000800U)         /* !< Command/Data Mode enable */
#define UNICOMMSPI_CTL1_CDENABLE_DISABLE         ((uint32_t)0x00000000U)         /* !< CS3 is used for Chip Select */
#define UNICOMMSPI_CTL1_CDENABLE_ENABLE          ((uint32_t)0x00000800U)         /* !< CS3 is used as CD signal */
/* UNICOMMSPI_CTL1[PTEN] Bits */
#define UNICOMMSPI_CTL1_PTEN_OFS                 (8)                             /* !< PTEN Offset */
#define UNICOMMSPI_CTL1_PTEN_MASK                ((uint32_t)0x00000100U)         /* !< Parity transmit enable If enabled,
                                                                                    parity transmission will be done for
                                                                                    both controller and peripheral modes. */
#define UNICOMMSPI_CTL1_PTEN_DISABLE             ((uint32_t)0x00000000U)         /* !< Parity transmission is disabled */
#define UNICOMMSPI_CTL1_PTEN_ENABLE              ((uint32_t)0x00000100U)         /* !< Parity transmission is enabled */
/* UNICOMMSPI_CTL1[SUSPEND] Bits */
#define UNICOMMSPI_CTL1_SUSPEND_OFS              (9)                             /* !< SUSPEND Offset */
#define UNICOMMSPI_CTL1_SUSPEND_MASK             ((uint32_t)0x00000200U)         /* !< Suspend external communication */
#define UNICOMMSPI_CTL1_SUSPEND_DISABLE          ((uint32_t)0x00000000U)         /* !< Functional mode resumed */
#define UNICOMMSPI_CTL1_SUSPEND_ENABLE           ((uint32_t)0x00000200U)         /* !< External communication suspended */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_unicommspi__include */

